tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "romkatv/powerlevel10k"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Open source relational database management system
brew "mysql"
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
brew "php", link: false
# Simplified and community-driven man pages
brew "tldr"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# 3D creation suite
cask "blender"
cask "font-fira-code"
# Clipboard manager
cask "maccy"
# Calculator and converter application
cask "numi"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
